package com.weymar87.base.withoutdsal;

public class Pressure {
    private double[][] arrRWithoutDsalPile = new double[][]{
            {
                    -0.3, -0.5, -1, -1.5, -2, -2.5, -3, -3.5, -4, -6, -8, 10
            },
            // При льдистости i<0.2
            //крупно-обломочные
            {
                    2500, 3000, 3500, 4000, 4300, 4500, 4800, 5300, 5800, 6300, 6800, 7300
            },
            //Пески крупные и средней крупности
            {
                    1500, 1800, 2100, 2400, 2500, 2700, 2800, 3100, 3400, 3700, 4600, 5500
            },
            //Пески мелкие и пылеватые
            {
                    850, 1300, 1400, 1500, 1700, 1900, 1900, 2000, 2100, 2600, 3000, 3500 //Глубина погружения 3-5 метров
            },
            {
                    1000, 1550, 1650, 1750, 2000, 2100, 2200, 2300, 2500, 3000, 3500, 4000 //Глубина погружения 10 метров
            },
            {
                    1100, 1700, 1800, 1900, 2200, 2300, 2400, 2500, 2700, 3300, 3800, 4000 //Глубина погружения 15 и более метров
            },
            //Супеси
            {
                    750, 850, 1100, 1200, 1300, 1400, 1500, 1700, 1800, 2300, 2700, 3000 //Глубина погружения 3-5 метров
            },
            {
                    850, 950, 1250, 1350, 1450, 1600, 1700, 1900, 2000, 2600, 3000, 3500 //Глубина погружения 10 метров
            },
            {
                    950, 1050, 1400, 1500, 1600, 1800, 1900, 2100, 2200, 2900, 3400, 3900 //Глубина погружения 15 и более метров
            },
            //Суглинки и глины
            {
                    650, 750, 850, 950, 1100, 1200, 1300, 1400, 1500, 1800, 2300, 2800 //Глубина погружения 3-5 метров
            },
            {
                    800, 850, 950, 1100, 1250, 1350, 1450, 1600, 1700, 2000, 2600, 3000 //Глубина погружения 10 метров
            },
            {
                    900, 950, 1100, 1250, 1400, 1500, 1600, 1800, 1900, 2200, 2900, 3500 //Глубина погружения 15 и более метров
            },
            // При льдистости 0.2<=i<=0.4
            // Все виды грунтов
            {
                    400, 500, 600, 750, 850, 950, 1000, 1100, 1150, 1500, 1600, 1700 //Глубина погружения 3-5 метров
            },
            {
                    450, 550, 700, 800, 900, 1000, 1050, 1150, 1250, 1600, 1700, 1800 //Глубина погружения 10 метров
            },
            {
                    550, 600, 750, 850, 950, 1050, 1100, 1300, 1350, 1700, 1800, 1900 //Глубина погружения 15 и более метров
            }
    };
    private double[][] arrRWithoutDsalPostFund = new double[][]{
            {
                    -0.3, -0.5, -1, -1.5, -2, -2.5, -3, -3.5, -4, -6, -8, 10
            },
            // При льдистости i<0.2
            //крупно-обломочные и пески крупные и средней крупности
            {
                    550, 950, 1250, 1450, 1600, 1800, 1950, 2000, 2200, 2600, 2950, 3300
            },
            //Пески мелкие и пыдеватые
            {
                    450, 700, 900, 1100, 1300, 1400, 1600, 1700, 1800, 2200, 2550, 2850
            },
            //Супеси
            {
                    300, 500, 700, 800, 1050, 1150, 1300, 1400, 1500, 1900, 2250, 2500 //Глубина погружения 3-5 метров
            },
            //Суглинки и глины
            {
                    250, 450, 550, 650, 800, 900, 1000, 1100, 1200, 1550, 1900, 2200 //Глубина погружения 10 метров
            },
            // При льдистости i>=0.2
            // Все виды грунтов
            {
                    200, 300, 400, 500, 600, 700, 750, 850, 950, 1250, 1550, 1750
            },
    };

        public double[][] getArrRWithoutDsalPile() {
                return arrRWithoutDsalPile;
        }

        public double[][] getArrRWithoutDsalPostFund() {
                return arrRWithoutDsalPostFund;
        }
}
