package com.weymar87.base.withdsal;

public class Resistance {
    private double[][] arrRafWithDsalPile = new double[][]{
            {
                    -0.3, -0.5, -1, -1.5, -2, -2.5, -3, -3.5, -4, -6, -8, 10
            },
            // Глинистые
            {
                    40, 60, 100, 130, 150, 180, 200, 230, 250, 300, 340, 380
            },
            // Песчаные
            {
                    50, 80, 130, 160, 200, 230, 260, 290, 330, 380, 440, 500
            },
            // Известково-песчаный раствор
            {
                    60, 90, 160, 200, 230, 260, 280, 300, 350, 400, 460, 520
            }
    };

        private double[][] arrRshWithDsalPile = new double[][]{
                {
                        -0.3, -0.5, -1, -1.5, -2, -2.5, -3, -3.5, -4, -6, -8, 10
                },
                // Песчаные
                {
                        80, 120, 170, 210, 240, 270, 300, 320, 340, 420, 480, 540
                },
                // Глинистые
                {
                        50, 80, 120, 150, 170, 190, 210, 230, 250, 300, 340, 380
                }
        };
}
